app/controllers/problems_controller.rb

    def index
        problems = Problem.all
---
SELECT "problems".* FROM "problems"

    def show
        problem = Problem.find(params[:id])
---
SELECT "problems".* FROM "problems" WHERE "problems"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]