app/controllers/professions_controller.rb

SELECT "professions".* FROM "professions"
---
    def index
        professions = Profession.all

SELECT "professions".* FROM "professions" WHERE "professions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "tests".* FROM "tests"
---
    def tests
        profession = Profession.find(params[:id])
        tests = Test.all.select {|test| test.profession_id == profession.id }