app/controllers/tests_controller.rb

    def show
        test = Test.find(params[:id])
        problems = Problem.all.select {|problem| problem.test_id == test.id }
---
SELECT "problems".* FROM "problems"