app/controllers/tests_controller.rb

SELECT "tests".* FROM "tests"
---
    def index
        tests = Test.all

SELECT "tests".* FROM "tests" WHERE "tests"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def show
        test = Test.find(params[:id])

SELECT "tests".* FROM "tests" WHERE "tests"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "problems".* FROM "problems"
SELECT "tests".* FROM "tests" WHERE "tests"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def problem
        test = Test.find(params[:id])
        problems = Problem.all.select {|problem| problem.test_id == test.id }